app/Http/Controllers/User/LikeController.php

    public function add(Request $request){
        $likedProduct = Like::where('product_id',$request->product_id)
                        ->where('user_id',Auth::id())->first();

        if(!$likedProduct) {
            Like::create([
                'user_id' => Auth::id(),
                'product_id' => $request->product_id,
            ]);
---
select `products`.*, `likes`.`user_id` as `pivot_user_id`, `likes`.`product_id` as `pivot_product_id`, `likes`.`id` as `pivot_id` from `products` inner join `likes` on `products`.`id` = `likes`.`product_id` where `likes`.`user_id` = 3
select * from `likes` where `product_id` = '8' and `user_id` = 3 limit 1
insert into `likes` (`user_id`, `product_id`, `updated_at`, `created_at`) values (3, '8', '2022-11-29 15:19:48', '2022-11-29 15:19:48')

    public function index(){
        $user = User::findOrFail(Auth::id());
---
select * from `users` where `users`.`id` = 3 limit 1