app/Http/Controllers/User/ProductController.php

select `id`, `name`, `user_id`, `information`, `filename`, `price` from `products` where `is_selling` = '1' and `products`.`name` like '%pc%' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `products` where `is_selling` = '1' and `products`.`name` like '%pc%'
---
    public function index(Request $request)
    {
        $products = Product::select('id','name','user_id','information','filename','price')
                    ->where('is_selling','1')
                    ->searchKeyWord($request->keyword)
                    ->orderBy('created_at','desc')
                    ->paginate(10);

insert into `products` (`name`, `information`, `price`, `user_id`, `filename`, `is_selling`, `updated_at`, `created_at`) values ('ps-4 playstaion4', 'playstation4です。', '11111', 3, '1576961901_6385d6be0eb3e.jpg', 1, '2022-11-29 18:54:06', '2022-11-29 18:54:06')
---
    public function store(Request $request)
    {
        //dd($request);

        $request->validate([
            'information' => 'required|string|max:200',
        ]);

        $imageFile = $request->image;
        $fileName = uniqid(rand().'_');
        $extension = $imageFile->extension();
        $fileNameToStore = $fileName.'.'.$extension;
        $resizedImage = InterventionImage::make($imageFile)->resize(1280,1280)->encode();

        Storage::put('public/products/'.$fileNameToStore, $resizedImage);

        Product::create([
            'name' => $request->name,
            'information' => $request->information,
            'price' => $request->price,
            'user_id' => Auth::id(),
            'filename' => $fileNameToStore,
            'is_selling' => true,
        ]);

select * from `products` where `products`.`id` = '7' limit 1
select * from `users` where `users`.`id` = 1 limit 1
---
    public function show($id)
    {
        $product = Product::findOrFail($id);
        $user = User::findOrFail($product->user_id);

delete from `products` where `id` = 24
select * from `products` where `products`.`id` = '24' limit 1
---
    public function destroy($id)
    {
        Product::findOrFail($id)->delete();

select * from `products` where `products`.`id` = '23' limit 1
---
    public function checkout($id){
        $product = Product::findOrFail($id);

delete from `products` where `id` = '16'
---
    public function success($id){
        Product::Where('id',$id)->delete();