app/Http/Controllers/User/UserController.php

    public function profile($userId){
        $products = Product::select('id','name','price','filename','user_id','information','is_selling')
                    ->where('user_id',$userId)
                    ->where('is_selling','1')
                    ->paginate(10);

        $user = User::findOrFail($userId);
---
select `id`, `name`, `price`, `filename`, `user_id`, `information`, `is_selling` from `products` where `user_id` = '3' and `is_selling` = '1' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `products` where `user_id` = '3' and `is_selling` = '1'
select * from `users` where `users`.`id` = '3' limit 1